[
    {
        "company" : "Fiverr",
        "title" : "Smart Contract Auditor",
        "duration" : "Febr. 2024 - Present",
        "description" : 
        [
            "Currently doing smart contract auditing on Fiverr as a freelancer and studying to be a Penetration tester (My dream job)"
        ]
        
    },
    {
        "company" : "Vibranium Audits",
        "title" : "Smart Contract Auditor ",
        "duration" : "May. 2023 - Febr. 2024",
        "description" : 
        [
            "Conducted comprehensive smart contract audits for a diverse range of projects spanning various industries, including finance, decentralized applications (dApps), and non-fungible tokens (NFTs).",
            "Identified critical vulnerabilities and potential security risks within audited smart contracts, ensuring the integrity and robustness of decentralized ecosystems.",
            "Developed detailed audit reports that articulated technical concepts in a clear and concise manner while providing actionable recommendations for enhancing code quality and mitigating identified risks."
        ]
        
    },
    {
        "company" : "BlockAudit",
        "title" : "Smart Contract Auditor",
        "duration" : "September 2021 - Present",
        "description" : 
        [
            "Conducted extensive audits of smart contract codes to identify security vulnerabilities, logical flaws, and other potential risks.",
            "Collaborated with development teams to ensure compliance with industry standards and best practices for smart contract development.",
            "Evaluated smart contracts for adherence to regulatory requirements and legal frameworks, including KYC/AML and data privacy regulations.",
            "Worked closely with clients to understand their business requirements and customize audit procedures accordingly."
        ]
        
    },

        {
        "company" : "NonceBlox",
        "title" : "Blockchain Engineer",
        "duration" : "Mar. 2022 - Nov. 2022",
        "description" : 
        [
            "Designed and developed blockchain-based applications using various platforms, such as Ethereum, Hyperledger Fabric, or Corda, to meet specific business needs.",
            "Worked on the full stack of blockchain technology, including smart contract development, distributed ledger technology, consensus algorithms, and decentralized application development.",
            "Collaborated with cross-functional teams, including business analysts, project managers, and developers, to design and implement blockchain solutions that align with business objectives.",
            "Integrated blockchain solutions with existing enterprise applications, data sources, and APIs to enable interoperability and data exchange between systems."
        ]
        
    }
]
